Enums/ВариантыОтраженияРасхождений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ВариантыОтраженияРасхождений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НедостачиЗаСчетСтороннейКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НедостачиЗаСчетПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НедостачиНаПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзлишкиВПользуПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзлишкиНаПрочиеДоходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыРасхождений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ВариантыРасхождений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Излишки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недостачи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыОтраженияРасхождений/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры.ВариантРасхождений) Тогда
		
		МассивВариантовОтраженияРасхождений = Новый Массив();
		
		Если Параметры.ВариантРасхождений = Перечисления.ВариантыРасхождений.Излишки Тогда
			
			МассивВариантовОтраженияРасхождений.Добавить(Перечисления.ВариантыОтраженияРасхождений.ИзлишкиВПользуПоставщика);
			МассивВариантовОтраженияРасхождений.Добавить(Перечисления.ВариантыОтраженияРасхождений.ИзлишкиНаПрочиеДоходы);
			Заголовок = НСтр("ru='Укажите вариант отражения излишков'");
			
		ИначеЕсли Параметры.ВариантРасхождений = Перечисления.ВариантыРасхождений.Недостачи Тогда
			
			МассивВариантовОтраженияРасхождений.Добавить(Перечисления.ВариантыОтраженияРасхождений.НедостачиЗаСчетПоставщика);
			МассивВариантовОтраженияРасхождений.Добавить(Перечисления.ВариантыОтраженияРасхождений.НедостачиЗаСчетСтороннейКомпании);
			МассивВариантовОтраженияРасхождений.Добавить(Перечисления.ВариантыОтраженияРасхождений.НедостачиНаПрочиеРасходы);
			Заголовок = НСтр("ru='Укажите вариант отражения недостач'");
			
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", МассивВариантовОтраженияРасхождений, ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
		
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти
